{
  "url": "https://www.getsunday.com/shop/lawn-care/summer-granular-fertilizer-lawn-kit",
  "product_slug": "summer-granular-fertilizer-lawn-kit",
  "product_name": "Summer Granular Fertilizer Kit",
  "description": "Everything your lawn needs to beat the heat\n\nGive your lawn staying power this summer with two powerful formulas designed for sustained growth, stress tolerance, and targeted weed control.\n\nHelp your lawn thrive through summer challenges. This premium kit combines our longest-lasting Core Endurance granular fertilizer with concentrated weed control for superior summer performance. You'll get up to 70 days of sustained feeding plus improved stress tolerance while keeping weeds at bay. Perfect for summer lawn care, when your grass needs both endurance and protection.\n\nAt Sunday, we create lawn solutions without harsh chemicals—so you can return to enjoying your lawn faster.",
  "sections": {
    "kit_benefits": "Premium granular fertilizer formula\nExtended 70-day feeding\nOffers stress tolerance and lower burn risk\nControls common lawn weeds\nWorks on all common grass types\nNo harsh chemicals\nEasy to apply",
    "whats_included": "2 Core Endurance Granular Fertilizer (23-0-3 NPK): Slow-release summer formula for sustained growth. Two 12 lb. bags cover 8,000 sq. ft.\n1 Dandelion Doom Concentrate: Iron-based weed control for summer broadleaf weeds.",
    "instructions": "For best results, apply when grass is actively growing.\nStart with Dandelion Doom: Mix Dandelion Doom in herbicide pouch according to label. Spot treat active spring weeds in lawn and let dry completely. Reapply 3-4 weeks later as needed.\nApply Core Endurance fertilizer: Use when soil temperature reaches 55°F. Apply evenly with spreader and water thoroughly after application. Reapply second bag in 45 days."
  },
  "image_url": "https://cdn.sanity.io/images/afv8yn22/production/bc74b2cfb4b2fc64c3a74aa0f230ea87385a6f47-2048x2048.png?w=1000&h=1000&fit=crop&auto=format&dpr=1",
  "image_path": "data\\images\\summer-granular-fertilizer-lawn-kit.png",
  "scraped_at_utc": "2026-01-19T17:39:17.699149+00:00",
  "product_url": "https://www.getsunday.com/shop/lawn-care/summer-granular-fertilizer-lawn-kit"
}